package week01;

public class A06_operator {
	public static void main(String[] args) {
		
		/*
		 * - 산술연산자
		    - +,-,*,/, %
		    - mod(%) 연산으로 승수, 지정한 특정 값이 나오게 가능, 난수 생성 가능
		    - Math.pow(a,b) : 제곱 → 클래스 메소드이다~
		- 비교연산자
		    - >,<,≥, ≤, ==, ≠
		    - 연산값은 항상 true, false로만 나온다
		- 논리연산자
		    - && : 둘 모두 true일 때 true, 논리합
		    - || : 둘 중 하나만 true여도 true로 판별, 논리차
		- 대입연산자
		    - 좌항에 우항의 값을 넣겠다
		    - a=b
		- 복합 대입 연산자
		    - +=, -=, /=, *=, %=
		- 삼항연산자
		    - 비교 ? 참 : 거짓;
		    - answer = a>b ? “A가 큽니다.” : “b가 큽니다.”;
		- 단항 연산자
		    - ++(전치, 후치 모두 가능), —
		    - ! : boolean 타입에서만 사용
		- 비트 연산
		    - ~ : 비트 반전
		        - signed bit에 따라서 양수, 음수가 달라진다 (0이면 양수, 1이면 음수)
		    - ^ : 비트연산자
		    - &,|,>>(right shift),<<(left shift),^(베타적 논리합, xor 연산)….
        - 이진수의 자릿수에 대한 연산
		 */
	}
}
